# 제출시 파일명은 Session06 이름 으로 해주세요.

# 1. LDA 코드를 활용하여 본인이 원하는 텍스트를 넣어 보기 => 텍스트 원본 파일 + LDA 결과 첨부 + 본인 결과 해석

#한국 힙합 가사 txt
topic_names = ["나","시간","생각","대상"]

for document, topic_counts in zip(documents, document_topic_counts): 
         print (document) 
         for topic, count in topic_counts.most_common(): 
             if count > 0: 
                 print (topic_names[topic], count)

#LDA결과
['사진' '야속' '시간' '얼굴' '겨울' '마음' '시간' '남' '설국' '열차' '손' '지구' '반대편' '겨울'
 '그리움' '눈' '봄날' '허공' '먼지' '먼지' '눈' '눈꽃' '밤' '널' '널' '겨울' '끝' '시' '봄날' '때'
 '꽃' '때' '순간' '시간' '거지' '모두' '거지']
시간 32
나 3
생각 2
['하루' '원망' '널' '불어' '연기' '연기' '말로' '널' '눈꽃' '밤' '널' '널' '아침' '어둠' '계절'
 '영원' '순' '벚꽃' '피' '겨울' '끝' '조금' '며칠' '밤' '갈게' '갈게' '갈게' '갈게' '추운' '겨울'
 '끝' '시' '봄날' '때' '꽃' '때' '시작']
시간 34
대상 3
['제일' '부탁' '바텐더' '연속' '침' '널' '처음' '말' '여자' '거려' '분위기' '줄기' '빛' '정도' '사춘기'
 '눈빛' '입술' '오랜만' '지도' '밤' '가기' '전' '널' '품' '안' '원해' '고민' '고민' '마' '포' '곳'
 '용' '흰머리' '양아치' '이제' '끝' '바람둥이']
시간 18
나 13
생각 6
['가닥' '나라' '남자' '원래' '싫증' '벌레' '나이' '사랑' '단' '뒤처리' '피눈물' '로맨스' '장단' '오락'
 '가락' '멜로디' '알토' '소프라노' '타락' '꿈' '눈빛' '입술' '오랜만' '지도' '밤' '가기' '전' '널' '품'
 '안' '원해' '고민' '고민' '마' '차' '술' '눈']
나 21
시간 16
['잠깐' '손' '잡고' '자' '속' '독' '소리' '때' '지' '속도' '속' '목소리' '날' '애' '눈물' '사탕'
 '슬픔' '쇠똥구리' '널' '그날' '결판' '순간' '터널' '눈가' '생각' '맘' '주세' '사람' '곳' '마른' '다리'
 '내가' '집' '밤하늘' '마음' '시간' '사랑']
생각 27
시간 9
나 1
['집' '서로' '심술' '자존심' '정도' '거리' '만큼' '맘' '말' '진심' '박자' '기가' '꼴' '꼴' '끝'
 '아파트' '원룸' '미안' '처음' '후' '니더' '뒷모습' '친구' '술' '자리' '속' '지' '무엇' '머리' '집'
 '지갑' '밤하늘' '마음' '시간' '사랑' '집' '아저씨']
생각 37
['사실' '곳' '사람' '마음' '곳' '가야' '집' '아저씨' '사람' '주세' '사람' '아' '곳' '가야' '집'
 '밤하늘' '마음' '시간' '사랑' '집' '골목길' '길' '마중' '버스' '정류장' '미용실' '르' '불' '집' '앞'
 '우연' '만화' '기적' '사람' '지금' '집' '사랑']
생각 35
나 1
시간 1
['사랑' '일' '잔' '지네' '반' '위로' '한숨' '기분' '봄' '가을' '이' '나로' '곁' '강' '내가' '눈물'
 '나' '길' '노래' '마음' '때' '이유' '스트레스' '증발' '대가' '때' '슬픔' '때' '눈물' '쯤' '엄지'
 '눈' '밑' '거지' '라' '소주병' '때']
대상 23
생각 8
나 6
['첨' '손' '담배' '구름' '우' '기침' '웃음' '혼자' '서로' '구라' '때' '우울' '불운' '날' '나태'
 '그물' '자기' '길' '물음' '머릿속' '무력' '현실' '때' '내가' '유령' '독' '무덤' '속' '날' '노래'
 '후렴' '때' '슬픔' '때' '눈물' '쯤' '엄지']
생각 23
시간 7
대상 7
['눈' '밑' '혼자' '오늘' '혼자' '집' '길' '잠' '수' '평점' '속' '채점' '과' '적막' '하루' '문턱'
 '내가' '나로' '허무' '가나' '가면' '이제' '가명' '갈피' '때' '건' '계산' '가치' '거짓' '껍질' '남'
 '세상' '서로' '장난' '판단' '힘' '눈']
생각 21
대상 16
['바람' '비가' '때' '때' '슬픔' '때' '눈물' '쯤' '엄지' '눈' '밑' '별' '하나' '추억' '별' '하나'
 '사랑' '별' '하나' '별' '하나' '동경' '별' '하나' '시' '별' '하나' '어머니' '시' '하늘' '우' '점'
 '부끄러움' '삶' '사랑' '때' '허무']
대상 37
['무기력' '때' '방' '등불' '기억' '용기' '뒤' '총칼' '연필' '끝' '힘' '창살' '건너편' '하늘' '별'
 '이름' '나의' '나라' '오늘' '흙' '별' '하나' '추억' '별' '하나' '사랑' '별' '하나' '별' '하나'
 '동경' '별' '하나' '시' '별' '하나' '어머니']
대상 35
시간 2
['별' '바람' '밤' '내가' '길' '밤' '기억' '별' '밤' '시' '하늘' '우' '점' '부끄러움' '꿈' '사랑'
 '비판' '비아냥' '입가' '시대' '뒤' '고개' '숙인' '한국인' '한국' '사람' '촛불' '위' '바람' '이름'
 '나라' '설움' '죄책감' '철인' '자화상' '모' '위로']
대상 31
나 3
생각 3
['덕' '일어' '어린아이' '걸음마' '오늘' '밤' '시가' '별' '광장' '위' '빛' '빛' '별' '하나' '추억'
 '별' '하나' '사랑' '별' '하나' '별' '하나' '동경' '별' '하나' '시' '별' '하나' '어머니' '별' '바람'
 '밤' '내가' '길' '밤' '기억' '별']
대상 37
['밤' '가슴' '속' '별' '팔' '위' '멍' '일본' '삶' '궤적' '맘' '덕' '나라' '이름' '지금' '정'
 '정당' '명예' '나라' '시인' '별' '하나' '추억' '별' '하나' '사랑' '별' '하나' '별' '하나' '동경'
 '별' '하나' '시' '별' '하나' '어머니']
대상 37
['별' '바람' '밤' '내가' '길' '밤' '기억' '별' '밤' '기' '프린트' '가사' '오류' '신고' '작사' '작곡'
 '별' '날' '별' '지금' '날' '날' '피해' '날' '오늘' '밤' '무의미' '밤' '아침' '온대' '구름' '때'
 '자리' '때' '구름' '이제' '비가']
시간 29
대상 8
['내리기' '기도' '별' '날' '별' '지금' '날' '날' '피해' '날' '노래' '지금' '매일' '밤' '손' '님'
 '피해' '품' '기도' '시간' '과정' '별' '날' '별' '지금' '날' '날' '피해' '날' '내가' '순간' '날'
 '이후' '흔적' '누' '구도' '손']
시간 31
생각 4
나 2
['수도' '안' '수도' '별' '날' '별' '지금' '날' '날' '피해' '날' '다섯' '때' '피아노' '영재' '베토벤'
 '모' '바' '쇼' '선배' '가사' '새끼' '모두' '엿' '베' '르' '사체' '무한' '악장' '하얀색' '대리석'
 '악장' '나의' '지휘봉' '사실' '수트' '바지']
시간 37
['돈' '부자' '겉' '틀' '칭호' '노' '창' '성' '떼' '나의' '라인' '말해' '내가' '삶' '일' '리스크'
 '비닐' '속' '안' '피아노' '돈' '숨구멍' '임' '악보' '동네' '땅' '구덩이' '선언' '자신' '임' '임'
 '소나타' '생각' '안해' '날' '라' '지금']
나 18
생각 15
대상 4
['악장' '끝' '카포' '절' '일' '박수' '악장' '할렐루야' '다섯' '때' '피아노' '영재' '베토벤' '모' '바'
 '쇼' '선배' '가사' '새끼' '모두' '엿' '베' '르' '사체' '무한' '악장' '하얀색' '대리석' '악장' '나의'
 '지휘봉' '돈' '영재' '파' '우' '테' '고']
시간 37
['이름' '한국' '노멀' '애' '엿' '무덤' '적' '예술' '전당' '날' '마' '스트로' '계급' '백건' '우'
 '카라얀' '위' '정도' '클래식' '용어' '끝' '악장' '이력' '여' '잔' '랩' '전용' '키보드' '맥' '북'
 '내' '위인' '갓' '세종' '연주' '삶' '다섯']
나 17
시간 10
생각 5
대상 5
['때' '피아노' '영재' '베토벤' '모' '바' '쇼' '선배' '가사' '새끼' '모두' '엿' '베' '르' '사체'
 '무한' '악장' '하얀색' '대리석' '악장' '나의' '지휘봉' '피' '땀' '눈물' '마지막' '춤' '피' '땀' '눈물'
 '숨' '피' '땀' '눈물' '피' '땀' '눈물']
시간 35
생각 2
['몸' '마음' '영혼' '벌' '주문' '날개' '악마' '앞' '날' '이상' '이제' '널' '목' '위스키' '피' '땀'
 '눈물' '마지막' '춤' '피' '땀' '눈물' '숨' '원해' '원해' '원해' '원해' '날' '날' '내가' '정신'
 '비밀' '감옥' '중독' '사람' '독' '성배']
시간 30
생각 7
['피' '땀' '눈물' '마지막' '춤' '피' '땀' '눈물' '숨' '원해' '원해' '원해' '원해' '손길' '눈' '거부'
 '피' '땀' '눈물' '피' '땀' '눈물' '비' '빗' '소' '내일' '알람' '그리움' '날' '나의' '널' '눈'
 '속' '날' '널' '후회' '속']
시간 31
대상 6
['이' '마' '날' '행복' '널' '사람' '행복' '널' '노래' '오해' '널' '노래' '곁' '마' '지금' '가사'
 '거리' '아무것' '노래' '사랑' '널' '위' '이별' '소리' '이해' '님' '당장' '노래' '마' '날' '행복'
 '널' '사람' '행복' '만약' '내가' '활']
생각 32
시간 5
['집' '앞' '비' '날' '전화' '길' '일' '쇼' '맘' '약해' '지지' '생각' '이기적' '나의' '말투' '행동'
 '굴' '때' '눈치' '불행' '자격' '자신' '여자' '엔' '널' '방법' '이해' '마' '사람' '행복' '말' '행복'
 '가' '필요' '필요' '꽃' '때']
생각 34
시간 3
['오늘' '죽기' '별' '오늘' '빛' '어둠' '세상' '원해' '기어' '기어' '총' '조준' '발사' '뱁새' '친구'
 '총' '조준' '발사' '마라' '소리' '마라' '손' '총' '조준' '발사' '성공' '차트' '덤블링' '트램펄린' '누'
 '실패' '서로' '서' '롤' '전부' '오늘' '절대']
생각 23
시간 13
대상 1
['곁' '나의' '곁' '말' '방탄' '총' '조준' '발사' '뱁새' '친구' '총' '조준' '발사' '마라' '소리'
 '마라' '손' '총' '조준' '발사' '눈' '속' '두려움' '가두' '유리' '천장' '승리' '그날' '무릎' '마'
 '마' '뱁새' '친구' '총' '조준' '발사' '마라']
생각 29
나 8
['소리' '마라' '손' '총' '조준' '발사' '손목' '길' '도배' '놀' '보기' '범죄' '삽' '마이크' '곳' '후'
 '장악' '콘텐츠' '일' '역시나' '과시' '부담' '소재' '인터넷' '접속' '오브제' '역할' '메인' '자리' '세대'
 '대세' '장래' '희망' '얼간이' '하루' '동선' '무대']
생각 19
시간 18
['위' '작업실' '오천' '분의' '일' '날개' '제대' '멍' '소파' '위' '숨' '머리' '위' '공기' '황인종'
 '밥' '검' '실력' '예의' '시비' '목적인' '우울' '때' '성공' '첫째' '악의' '티켓' '매진' '차기' '작'
 '매진' '위' '장관' '바닥' '난' '높이' '위험']
대상 28
시간 8
나 1
['과로' '체질' '링거' '투혼' '휴가' '반납' '뇌물' '공여' '면' '위법' '그림' '일부' '일' '거수' '일투족'
 '세간' '집중' '논란' '재기' '탄력' '절제' '제대' '멍' '소파' '위' '숨' '머리' '위' '공기' '증명'
 '안중' '에이' '에이' '재수' '삼각관계' '사실' '바다']
대상 34
생각 3
['샘' '획' '직' '직' '직' '머리' '위' '숨' '발' '손' '손목' '길' '도배' '놀' '보기' '범죄' '널'
 '눈빛' '오' '직' '너와' '파' '낮' '밤' '남자' '날' '대부분' '날' '착각' '원' '맘' '심장' '때'
 '내가' '내' '귓가' '휘파람']
시간 26
생각 10
나 1
['마' '날' '향' '마음' '심장' '파람' '파람' '파람' '파람' '밤' '휘파람' '파람' '파람' '파람' '밤'
 '말' '마' '소리' '생각' '느낌' '곁' '앞' '마음' '속' '게임' '내가' '널' '누' '널' '가로' '채'
 '가기' '전' '내가' '마' '날' '향']
생각 28
시간 9
['마음' '심장' '파람' '파람' '파람' '파람' '밤' '휘파람' '파람' '파람' '파람' '밤' '바람' '인연' '길'
 '말' '필요' '지금' '곁' '어른' '유년기' '시절' '기분' '행복' '담배' '여자' '존재' '전쟁' '삶' '행복'
 '실망' '행복' '조바심' '사랑' '꽁무니' '웃음' '내']
생각 30
시간 6
나 1
['악몽' '깨' '내' '사고' '방식' '깨' '수' '열쇠' '꾸러미' '문' '건' '노력' '존재' '미래' '행복'
 '얼굴' '거짓말' '널' '뒷골목' '해방' '반창고' '시간' '최초' '노래' '가사' '말' '곳' '서서' '이름'
 '우주' '말' '내' '중요' '세상' '행복' '내' '시작']
나 18
생각 16
대상 2
시간 1
['답' '실행' '결론' '산' '갈래' '두발' '구름' '태양' '날' '행복' '발' '얼굴' '거짓말' '널' '숱'
 '고통' '속' '몸부림' '그림' '널' '마법' '마음' '행복' '행복' '여자' '존재' '여자' '존재' '품' '세상'
 '이름' '내' '시작' '답' '실행' '결론' '산']
생각 30
시간 5
대상 2
['갈래' '두발' '구름' '태양' '날' '행복' '갈래' '두발' '널' '행복' '갈래' '두발' '행복' '행복' '노래'
 '행복' '행복' '이름' '거북선' '열' '명의' '판옥선' '천자' '총통' '발포' '전' '무한' '도전' '필'
 '충무공' '역사' '공부' '영화' '노래' '이순신' '동상' '앞']
생각 34
시간 3
['동장군' '전' '날' '아가' '영웅' '울돌목' '바다' '현' '시국' '레드' '군' '장군' '양반' '노비' '국민'
 '단어' '앞' '이제' '게임오버' '겁' '겁' '배' '멀미' '멀미' '아버지' '아버지' '정답' '겁' '겁' '배'
 '멀미' '멀미' '뒤' '허공' '선' '준비' '화살']
대상 28
나 5
시간 3
생각 1
['화살' '화살' '화살' '화살' '화살' '랩' '난중' '일기' '내' '신발' '명품' '짚신' '서울' '한복판'
 '학익진' '지사' '자세' '위인' '미천' '신' '사명감' '상처' '유감' '끝' '십상' '시' '이루' '리' '겁'
 '겁' '배' '멀미' '멀미' '아버지' '아버지' '정답' '겁']
대상 31
나 6
['겁' '배' '멀미' '멀미' '뒤' '허공' '선' '준비' '화살' '화살' '화살' '화살' '화살' '화살' '마라'
 '안' '내포' '근성' '여태' '동전' '면' '선조' '함성' '목소리' '생각' '지금' '그때' '두려움' '용기' '라'
 '때' '화살' '화살' '화살' '화살' '화살' '화살']
대상 29
생각 8
['화살' '만남' '대도' '하루' '하루' '널' '진심' '이름' '세상' '사람' '모두' '때' '때' '지금' '옆'
 '곁' '이대' '때' '처음' '안' '꿈속' '단순' '내' '성질' '불씨' '꽃' '만난' '후' '탄생' '둘' '밤새'
 '하모니' '불꽃' '오늘' '신' '감사' '빚']
생각 27
시간 10
['피사체' '있음' '감상' '명작' '마음' '때' '가슴' '때' '지금' '옆' '곁' '자리' '시간' '대도' '안'
 '꿈속' '후' '이상' '거리' '여자' '말' '목소리' '뒤' '바보' '입가' '미소' '생각' '꿈속' '예' '신'
 '예' '상처' '투' '라면' '홀' '길' '끝']
생각 34
시간 3
['발' '때' '곁' '너와' '함' '예' '내' '날개' '손' '내' '날개' '날개' '아픔' '빛' '날개' '테' '손'
 '함' '내가' '선택' '길' '운명' '내가' '죄' '생이' '내가' '죗값' '하늘' '끝' '손' '너와' '함' '손'
 '온기' '혼자' '길이' '때']
시간 23
생각 14
['론' '너와' '함' '너와' '함' '너와' '함' '적의' '기억' '걱정' '깃털' '날개' '날개' '믿음' '신념'
 '웃음' '소리' '새' '길' '일' '원해' '내가' '일' '성공' '날' '날' '내' '날개' '널' '지금' '미약'
 '끝' '창대' '비약' '길' '말' '이제']
시간 29
생각 8
['고작' '비행' '공기' '날' '아가' '날' '아가' '날개' '후회' '믿음' '날' '예전' '내가' '길' '고개'
 '하늘' '소녀' '때' '핑계' '미래' '소망' '두려움' '내' '안' '공존' '때' '그때' '난' '거짓말쟁이' '안'
 '바램' '턴' '세상' '행복' '인정' '미안' '무의식']
생각 26
대상 11
['영이' '곳' '꿈' '집착' '행복' '자각' '창' '대하' '날' '얼굴' '오늘' '행복' '때' '새' '내가' '자랑'
 '꿈' '차례' '모두' '때' '선택' '삶' '날' '예' '감이' '날씨' '하늘' '태양' '맥박' '말' '어제' '날'
 '지금' '나로' '내가' '중심' '주']
생각 14
나 13
시간 10
['공인' '주인공' '생각' '마찬가지' '말' '생각' '믿음' '실상' '증' '머리' '영혼' '기대' '자' '비가' '법'
 '축복' '내가' '입' '순수' '모두' '날' '삶' '날' '내' '향기' '얼굴' '오늘' '행복' '때' '새' '내가'
 '자랑' '꿈' '차례' '모두' '때' '눈']
시간 15
생각 14
나 8
['사막' '바다' '가운데' '길' '이리' '길' '길' '어른' '길이' '혼란' '길' '길' '방법' '새' '비바람'
 '속' '구라' '복잡' '세상' '속' '나의' '길' '개미' '길' '법' '며칠' '방황' '쓸모' '좌절' '집' '개미'
 '길이' '혼란' '길' '길' '방법' '새']
생각 37
['비바람' '속' '구라' '복잡' '세상' '속' '나의' '길' '기약' '희망' '여' '안녕' '발' '길' '길' '가도'
 '새' '비바람' '속' '구라' '복잡' '세상' '속' '나의' '길' '대한민국' '내' '폰' '부재중' '브랜드' '평판'
 '섭외' '순위' '말' '대세' '인증' '눈']
생각 37
['확인' '순간' '게임' '끝' '고' '때' '일' '지금' '일상' '대기업' '회장' '과의' '식사' '상상' '눈앞'
 '삶' '내' '이름' '돈' '내' '직장' '오늘' '인터넷' '기사' '제목' '비' '와이' '열풍' '끝' '이제'
 '시작' '폭' '내가' '인기' '인기' '얼굴' '말']
시간 21
나 16
['성공' '연구' '느낌' '어' '때' '엄마' '새' '흐름' '선구자' '비' '와이' '애' '사칭' '감사' '삶'
 '할렐루야' '그린' '대' '밤' '그린' '대' '지네' '애인' '친구' '개' '여자' '친구' '해' '유치' '잼'
 '잼' '귀' '비' '와이' '말' '감사' '하나님']
시간 34
생각 2
나 1
['회개' '놈팽이' '지갑' '때' '위' '위로' '외국인' '숙녀' '과도' '매' '촬영' '투' '위' '테이프' '어제'
 '이태원' '내가' '여유' '용서' '명예' '여자' '내가' '생각' '목요일' '밤' '내일' '거래' '오늘' '밤'
 '내가' '사람' '사람' '내가' '대' '내가' '사람' '그린']
생각 29
시간 8
['대' '밤' '그린' '지네' '유명인' '서울' '대전' '대구' '이제' '래퍼' '머리' '용돈' '빚' '그린' '대'
 '밤' '그린' '대' '지네' '애' '의미' '날짜' '손' '꽃' '무대' '나비' '날갯짓' '이제' '크리스탈' '별과'
 '빛' '널' '널' '위' '날' '위' '어깨']
시간 32
대상 5
['글' '갈래' '내가' '모자' '마' '인' '순간' '불안' '연속' '연속' '내가' '부족' '미안' '자존심' '프라다'
 '엘' '라' '자격지심' '누' '값' '칠' '누' '가면' '미안' '상처' '별거' '애' '날' '사랑' '이제' '널'
 '이' '도시' '마' '압구정' '속' '먼지']
생각 24
시간 13
['특별' '위안' '사랑' '때' '때' '초라' '빛' '프라다' '엘' '라' '자격지심' '약' '목소리' '냉수' '커피'
 '이래' '일' '열' '과거' '내가' '대체' '바람' '말' '속' '더위' '하기' '원' '주위' '말' '간' '길'
 '봄' '코' '앞' '여름' '햇볕' '밤']
생각 30
대상 7
['주말' '오늘' '간의' '감정' '말' '할거' '전' '티켓' '널' '길' '향수' '조' '도' '때' '오늘' '말'
 '간' '길' '봄' '코' '앞' '여름' '사람' '속' '밤' '위로' '해' '오늘' '전화번호' '여자' '곁' '널'
 '눈치' '이야기' '계절' '너와' '나의']
시간 23
생각 9
대상 3
나 2
['곁' '순간' '사실' '다음' '불' '친구' '티' '흠' '말' '이유' '남자' '때' '단' '선택' '복종' '죽음'
 '땅' '자유' '해방' '쟁투' '피' '땀' '땅' '가슴속' '자' '만이' '대한민국' '목숨' '후손' '미래' '만이'
 '지배자' '실패' '앞' '앞' '만이' '타국']
나 30
시간 6
대상 1
['태양' '거대' '대지' '대체' '외로움' '향기' '몸' '사나이' '뜻' '고향' '마지막' '집' '절대' '감리'
 '사이' '피' '독립' '어제' '오늘' '그날' '기도' '땅' '해방' '하얼빈' '앞' '내' '방아쇠' '나의' '민족'
 '조국' '총성' '코' '레' '아우' '만세' '순간' '만세']
시간 23
생각 14
['내일' '오늘' '만세' '자유' '춤' '만세' '만세' '만세' '만세' '만세' '자유' '춤' '만세' '역사' '민족'
 '존재' '내일' '곳' '방랑자' '땅' '내일' '오늘' '마지막' '날' '게' '내일' '만세' '만세' '운동' '자신감'
 '나의' '강' '심장' '자유' '피' '땀' '눈']
시간 35
생각 2
['눈' '내일' '길' '혁명' '전' '사진' '전' '마지막' '나의' '나라' '민족' '무릎' '하늘' '앞' '파괴'
 '창조' '악' '선' '축제' '장' '코' '레' '아우' '목숨' '후손' '미래' '만이' '지배자' '실패' '앞' '앞'
 '만이' '코' '레' '아우' '만세' '순간']
시간 24
나 13
['만세' '내일' '오늘' '만세' '자유' '춤' '만세' '만세' '만세' '순간' '만세' '내일' '오늘' '만세' '자유'
 '춤' '만세' '만세' '만세' '만세' '만세' '자유' '춤' '만세' '여름' '손' '미소' '선명' '무대' '가사'
 '창밖' '비' '바람' '얼굴' '올해' '여름' '끝']
시간 37
['달' '하루' '일' '일' '오늘' '어제' '노래' '기억' '속' '여름' '손바닥' '무대' '위' '몸' '횟수'
 '얼굴' '기억' '앞' '라인업' '시작' '얼굴' '내일' '눈앞' '미안' '마' '둘' '여름' '손' '미소' '선명'
 '나의' '음악' '루즈' '머릿속' '내' '몸짓' '손']
시간 29
생각 8
['온도' '무대' '아래' '발길' '뜸' '그때' '자연' '기억' '겨울' '무대' '성탄절' '선물' '우' '조명' '무대'
 '각자' '자리' '가슴속' '여름' '손' '미소' '선명' '미소' '프린트' '가사' '오류' '신고' '작사' '작곡'
 '꽃' '길' '말' '말' '일' '말' '말' '말']
시간 33
대상 3
생각 1
['거짓말' '아이' '돌' '가사' '맘' '비디오' '힘' '짓' '짓' '조금' '있음' '니들' '자격지심' '덕분' '때'
 '증명' '박수' '해' '우리' '행복' '기억' '손' '기억' '손' '날' '앞' '말' '날' '말' '날' '이기'
 '무대' '뒤' '그림자' '속' '어둠' '속']
시간 18
대상 10
생각 8
나 1
['아픔' '날' '눈물' '상처' '감당' '나의' '빛' '화' '양' '연화' '꽃' '기억' '손' '기억' '손' '날'
 '앞' '말' '날' '말' '기억' '손' '기억' '손' '날' '앞' '말' '날' '말' '기억' '손' '기억' '손'
 '오늘' '둘' '돈' '일']
시간 37
['나발' '가위바위보' '삼세판' '마' '간' '말' '불한당' '당' '골' '눈' '사랑' '내가' '미친놈' '밤' '오'
 '낮' '비쥬얼' '깡패' '비쥬얼' '깡패' '비쥬얼' '깡패' '사랑' '사랑' '눈물' '느낌' '사랑' '사랑' '눈물'
 '느낌' '인생' '반' '내' '칼' '반복' '시행착오' '대기']
나 26
시간 9
생각 2
['번호' '손자' '손녀' '며느리' '어머니' '야' '나도' '아들' '딸' '완전' '환자' '환장' '팔자' '약' '억지'
 '밥' '완전' '환자' '환장' '팔자' '사랑' '사랑' '흉내' '내진' '비쥬얼' '깡패' '비쥬얼' '깡패' '비쥬얼'
 '깡패' '사랑' '사랑' '눈물' '느낌' '사랑' '사랑' '눈물']
나 33
시간 4
['느낌' '사랑' '사랑' '눈물' '느낌' '완전' '환자' '환장' '팔자' '완전' '환자' '환장' '팔자' '래퍼'
 '딱지' '중' '폼' '예술가' '길' '신념' '새' '역사' '지네' '발자취' '증인' '삶' '삶' '권능' '내'
 '바지' '주머니' '위치' '일시적' '세상' '영원' '유행' '매']
나 23
시간 14
['예술' '집합체' '걸음' '시작' '요즘' '이빨' '데는' '이어폰' '무대' '위' '지금' '비' '와이' '꿈' '시간'
 '느낌' '미간' '주름' '래퍼' '점차' '인' '십일조' '봉투' '장' '주머니' '안' '회사' '나의' '몸' '집중'
 '관심' '명예' '돈' '전부' '꿈나무' '가치' '영원']
시간 23
나 14
['운세' '곳' '시간' '비' '여기저기' '이름' '최고' '말' '최고' '사실' '카메라' '정작' '내' '앞' '오지'
 '돈' '잔고' '유명' '입술' '집착' '절대' '안' '눈' '우상' '평생' '절' '존재' '계속' '거대' '감이'
 '곳' '시간' '비' '비' '한계' '내적' '내']
시간 14
나 12
생각 11
['매듭' '개척' '꿈' '기억' '최초' '세계' '소' '계속' '무언가' '믿음' '주' '내' '걸' '영광' '평화'
 '래퍼' '평화' '영화' '속' '최고' '역할' '필요' '가사' '속' '이름' '말' '방금' '내가' '기억' '날'
 '신의' '전지' '전능' '가' '내' '실력' '삶']
나 23
생각 13
대상 1
['증오감' '시간' '부정적' '에너지' '집중' '머릿속' '이름' '이름' '발음' '발음' '건강' '방송' '지금' '내가'
 '소리' '개소리' '패턴' '북' '말' '사물놀이' '괴물' '꼬리' '날' '동물원' '거리' '날' '날' '무' '널'
 '잠' '틈' '놈' '내' '총알' '받이' '도배' '무대']
생각 16
나 13
시간 8
['연행' '결백' '만족' '위' '방식' '길' '땀' '바느질' '가능' '포기' '발음' '들' '일' '리그' '플레이'
 '위' '감독' '그림' '평생' '위치' '명예' '부' '결국' '발' '바닥' '클릭' '내년' '입주' '내' '야망'
 '귀' '처음' '이자' '마지막' '말' '뱁새' '대인']
생각 16
나 14
시간 7
['배' '해이' '갱생' '내' '계획' '인' '스타' '속' '인생' '인생' '손목' '위' '도움' '손' '차이' '절대'
 '똥차' '콩깍지' '다음' '농락' '뒤' '송' '면상' '위' '하나' '감사' '인생' '어중간' '탓' '미안' '앞'
 '건강' '귀티' '귀티' '빛' '빛' '진리']
나 23
대상 9
시간 5
['이자' '이치' '누' '놈' '세상' '최고' '누' '말' '세기' '소녀' '세기' '소녀' '강' '세기' '소녀'
 '남자' '넋' '여자' '절대' '마' '추진' '마' '세기' '소녀' '세기' '소녀' '강' '세기' '소녀' '걱정'
 '마' '사랑' '세기' '소녀' '세기' '소녀' '곳']
생각 34
대상 2
시간 1
['하늘' '위' '목숨' '노예' '올림픽' '세상' '내가' '신경' '안' '대기업' '현명' '남' '탐' '부탁' '내'
 '베' '스타일' '전화기' '나의' '친구' '부탁' '천불' '고민' '돈' '차이' '나도' '곡' '곡' '차이' '나도'
 '외제' '차' '외제' '차' '차이' '나도' '인기']
나 34
시간 3
['인기' '차이' '나의' '기도' '바라' '난' '대통령' '뒤' '조종' '반항적' '가치관' '거짓말' '가' '안'
 '사랑' '결국' '변해' '미안' '거짓말' '이대' '사랑' '생각' '이별' '느낌' '일' '생각' '병신' '나로' '선'
 '야' '미안' '죄책감' '얼굴' '나도' '알' '믿음' '단']
생각 26
나 10
대상 1
['하나' '개새끼' '버릇' '남' '주' '미안' '눈물' '지금' '턴' '진심' '진실' '말' '입' '밖' '맘' '가난'
 '사랑' '안' '눈물' '마음' '사랑' '간' '대출금' '옆집' '고함' '앞' '고양이' '개' '보' '거짓말' '가'
 '안' '사랑' '결국' '변해' '미안' '거짓말']
생각 33
시간 4
['이대' '사랑' '생각' '이별' '느낌' '일' '생각' '사랑' '티비' '영화' '소설' '애초' '진저리' '사랑' '끝'
 '비극' '희극' '사랑' '감정' '연기' '눈물' '진심' '라' '음' '제법' '자세' '연기' '짜증' '머릿속' '저녁'
 '메뉴' '고민' '입술' '오늘' '안녕' '세상' '잔인']
생각 32
나 4
시간 1
['말로' '강남' '다시' '고개' '수영도' '하면서' '바다' '사랑' '거짓말' '가' '안' '사랑' '결국' '변해'
 '미안' '거짓말' '이대' '사랑' '생각' '이별' '느낌' '일' '생각' '속고' '속고' '믿음' '병신' '한번'
 '도화지' '하' '낙서' '가슴' '바보' '한번' '도화지' '하' '낙서']
생각 37
['거짓말' '가' '안' '사랑' '결국' '변해' '미안' '거짓말' '이대' '사랑' '생각' '이별' '느낌' '일' '생각'
 '때' '귀' '눈' '마음' '물고기' '살' '이름' '개' '돼지' '개' '황새' '뱁새' '전쟁' '세상' '세상' '끝'
 '말' '거짓말' '세상' '마' '세상' '사방']
생각 34
나 3
['온라인' '오프' '라인' '뉴스' '글' '증오' '정상' '비정상' '세상' '끝' '말' '거짓말' '세상' '세상' '길'
 '믿음' '말' '거짓말' '세상' '하이' '하늘' '왕' '이유' '힘' '사람' '백성' '위' '자리' '방자' '욕심'
 '허' '균' '이' '외세' '침입' '권력자' '부정']
생각 18
나 10
대상 9
['부패' '민심' '이반' '정' '약용' '말' '순' '발걸음' '순' '유관순' '주먹' '위로' '역사' '이름' '힘'
 '촛불' '불이' '잠' '자신' '나' '위' '내편' '이' '곳' '강' '위로' '꿈' '하늘' '위' '주먹' '목'
 '소' '문' '한길' '역사' '속' '위인']
대상 35
생각 2
['역사' '속' '위인' '역사' '속' '위인' '역사' '속' '위인' '하늘' '위' '주먹' '목' '소' '문' '한길'
 '역사' '속' '위인' '역사' '속' '위인' '역사' '속' '위인' '역사' '속' '위인' '하늘' '땅' '때' '분명'
 '이유' '좌절' '실패' '나라' '평화']
대상 37
['목숨' '위인' '묵음' '강' '자가' '자가' '강' '집' '뜻' '전' '말' '사리' '윤봉길' '남' '이상' '남과'
 '희망' '꿈' '때' '기회' '자의' '기' '사람' '오' '진실' '안창호' '날' '말' '뜻' '내편' '이' '곳'
 '강' '위로' '꿈' '하늘' '위']
대상 23
생각 14
['주먹' '목' '소' '문' '한길' '역사' '속' '위인' '역사' '속' '위인' '역사' '속' '위인' '역사' '속'
 '위인' '하늘' '위' '주먹' '목' '소' '문' '한길' '역사' '속' '위인' '역사' '속' '위인' '역사' '속'
 '위인' '역사' '속' '위인' '내편']
대상 37
['이' '곳' '강' '위로' '꿈' '하늘' '위' '주먹' '목' '소' '문' '한길' '역사' '속' '위인' '역사'
 '속' '위인' '역사' '속' '위인' '역사' '속' '위인' '하늘' '위' '주먹' '목' '소' '문' '한길' '역사'
 '속' '위인' '역사' '속' '위인']
대상 37
['역사' '속' '위인' '역사' '속' '위인' '만약' '말' '야' '내가' '말' '야' '말' '혼자' '생각' '취향'
 '입맛' '맛' '맛' '내가' '내가' '생각' '무엇' '필요' '속마음' '대답' '가치' '말' '언어' '코드' '행복'
 '상상' '마' '매직' '널' '만약' '말']
생각 32
대상 5
['야' '내가' '말' '야' '말' '혼자' '생각' '취향' '입맛' '맛' '맛' '내가' '내가' '생각' '기분' '내가'
 '느낌' '오감' '만족' '소리' '말' '언어' '코드' '순도' '행복' '만약' '말' '야' '내가' '말' '야' '말'
 '혼자' '생각' '취향' '입맛' '맛']
생각 37
['맛' '내가' '내가' '날' '이해' '이해' '반대' '내가' '진심' '감동' '취향' '입맛' '맛' '맛' '내가'
 '내가' '취향' '입맛' '맛' '맛' '내가' '내가' '술독' '해' '사람' '구실' '전' '반지하' '속' '술병'
 '폐인' '후' '취직' '돈' '총' '모양' '모습']
생각 37
['오른손' '위' '위치' '돈' '관리' '허' '내' '귀밑' '잠실' '지하' '피어싱' '덕' '소' '새끼' '마디'
 '전' '내가' '무엇' '알' '녹음' '돈' '탈' '가마' '컵' '주머니' '기억' '나라' '순식간' '한숨' '허무'
 '이성적' '정' '마' '아이' '발걸음' '보' '돈']
나 37
['사업' '속' '아이' '속' '상하지' '마' '초반' '씨' '아이' '아이' '아이' '아이' '아이' '아이' '아이'
 '아이' '아이' '아이' '아이' '아이' '아이' '아이' '아이' '아이' '대한민국' '앞길' '키' '여' '내' '앞'
 '벽' '선택권' '파블' '벽난로' '추' '윌' '현찰']
나 37
['내가' '인생' '오렌지색' '터널' '꼰대' '이해' '아저씨' '차원' '을' '갑' '갓' '도끼' '구리' '김' '포'
 '시' '끼' '모두' '뒤' '기억' '날' '시' '끼' '곡' '때' '리듬' '표절' '작곡가' '이름' '창모' '가족'
 '히트' '삶' '순간' '이' '계집애' '미안']
대상 19
나 12
생각 6
['사랑' '앤' '덕' '소' '씨' '발' '배' '신해' '쇄신' '인생' '질' '메' '뒷얘기' '앞' '좆' '나라'
 '사회' '생활' '천재' '정' '마' '아이' '발걸음' '보' '돈' '사업' '속' '아이' '속' '상하지' '마'
 '초반' '씨' '아이' '아이' '아이' '아이']
나 36
시간 1
['아이' '아이' '아이' '아이' '아이' '아이' '아이' '아이' '아이' '아이' '아이' '아이' '문' '모두' '날'
 '바라' '봄' '노력' '남자' '코피' '지금' '날' '위' '축' '배' '손' '가' '말로' '불빛' '날' '특별'
 '다라' '단' '다라' '단' '바우' '분위기']
나 32
대상 3
시간 2
['밤' '너와' '오빠' '오빠' '무엇' '철' '겁' '오빠' '오늘' '너와' '젊음' '막지' '마' '혹시나' '누'
 '날' '손' '허리' '내' '몸매' '특별' '눈빛' '바우' '분위기' '오늘' '밤' '너와' '오빠' '오빠' '오늘'
 '정신' '하늘' '끝' '오늘' '정신' '하늘' '끝']
시간 33
나 4
['시간' '미래' '세상' '모습' '그때' '지혜' '건' '여전' '자신' '혹' '독해' '주변' '엄격' '백성' '위'
 '밤' '가슴' '공부' '점' '후대' '시력' '포기' '눈' '글' '눈' '앞' '현실' '말' '상처' '거지' '실망'
 '물음' '명령' '대화' '회피' '책임' '통치']
생각 23
나 8
대상 6
['보살핌' '때' '시간' '순' '의지' '품' '해' '마' '나의' '우상' '나의' '영웅' '나의' '왕' '자긍심'
 '고취' '애민' '정신' '창' '제한' '훈민정음' '가사' '우상' '나의' '영웅' '나의' '왕' '나라' '사람'
 '나라' '사랑' '화폐' '교과서' '존경' '노비' '백성' '국민']
나 36
생각 1
['삶' '살' '꿈' '직장인' '학생' '반' '이상' '수면' '부족' '외투' '난세' '속' '국민' '잠재적' '위인'
 '뿌리' '역사' '힘' '자식' '글' '시작' '왼쪽' '소매' '얘기' '아빠' '이분' '공경' '하렴' '때' '시간'
 '순' '의지' '품' '해' '이대' '업적' '반']
나 18
대상 14
생각 5
['하나' '평생' '고민' '세종' '이' '의미' '기록' '실록' '소리' '위로' '위' '어깨' '고개' '변화' '때'
 '시간' '순' '의지' '이제' '곁' '시간' '발' '힘' '땅' '무릎' '무릎' '주' '앞' '눈' '미래' '때'
 '내가' '무엇' '하나' '해답' '기도' '펜']
나 25
대상 12
['꿈' '의심' '기대' '날' '시간' '생각' '행동' '밑바닥' '현주소' '두려움' '배' '길' '내가' '길' '가기'
 '내' '미' '랜' '시작점' '정반대' '세상' '가능성' '오늘' '잔' '밤' '꿈' '열정' '날' '내' '시간'
 '악한' '삶' '안' '때' '시간' '지혜' '사용']
나 22
생각 13
대상 2
['정복' '질' '내일' '사명' '다' '이름' '중' '오늘' '태' '도로' '자세' '눈' '위' '내가' '대표' '목'
 '관이' '전' '꿈' '자만' '콧대' '시간' '나의' '아버지' '어머니' '말씀' '날' '지금' '내가' '시간' '위'
 '시계' '시간' '위' '시간' '위' '시계']
나 28
대상 9
['시간' '위' '시계' '시간' '위' '죽음' '곡' '시작' '몸' '미세' '주름' '시간' '땅' '꿈' '현실' '신의'
 '공짜' '미래' '내가' '꿈' '개꿈' '애' '날' '때' '꿈' '포기' '내가' '책상' '앞' '랩' '때' '세상'
 '책망' '지금' '꿈' '계속' '티']
나 32
대상 5
['이름' '믿음' '향' '길' '상상' '실현' '미래' '내가' '나의' '미래' '선택' '의심' '신' '날' '꿈'
 '능력' '한도' '꿈' '본전' '생각' '약속' '내가' '발자국' '유일' '원동력' '신의' '계획안' '믿음' '만이'
 '능력' '시간' '위' '시계' '시간' '위' '시간' '위']
나 30
생각 6
시간 1
['시계' '시간' '위' '시간' '시간' '속' '기도' '손' '하늘' '의심' '확신' '담' '대함' '나약' '자신'
 '의지' '아버지' '의지' '날' '세우' '소' '진' '미비' '미비' '창대' '지금' '미래' '오늘' '거리' '위'
 '발걸음' '하루' '종일' '삶' '주신' '주' '한계']
나 35
생각 2
['그날' '맞이' '삶' '신이' '예술' '작품' '나의' '불완전' '사용' '창조주' '위대' '이야기' '시간' '위'
 '시계' '시간' '위' '시간' '위' '시계' '시간' '위' '시계' '시간' '위' '요즘' '잠' '배가' '고파도'
 '밥' '순' '내일' '공연' '진지' '년' '생각' '삶']
나 36
생각 1
['사람' '관심' '스케줄' '음악' '대화' '생각' '일' '무대' '땀' '요새' '사람' '감사' '말' '야' '생각'
 '전화' '채로' '연락' '미안' '미안' '전화' '채로' '연락' '미안' '미안' '동네' '스피커' '사이' '노래'
 '거짓말' '취향' '성격' '건' '여전' '여름' '겨울' '예전']
생각 31
시간 6
['서울' '말' '사계절' '걱정' '위치' '기분' '세상' '나도' '변해' '모두' '모두' '생각' '전화' '채로'
 '연락' '미안' '미안' '전화' '채로' '연락' '미안' '미안' '불빛' '스피커' '붐' '욕심' '초심' '촛농'
 '마음' '지' '때' '방' '가두' '여' '길' '사람' '환호']
생각 35
나 2
['박수갈채' '산' '길' '용해' '오늘' '여행' '가사' '마지막' '줄' '오빠' '무리' '옆' '여자' '대접' '친구'
 '흥' '사교성' '애' '로만' '한국' '느낌' '일' '렉' '절대' '안' '알콜' '샤워' '고주' '망태' '누' '키'
 '호기심' '미성년' '주체' '바람' '주최' '날']
시간 37
['인' '스타' '목적' '겉옷' '안목' '누나' '전화기' '분위기' '진지' '즉시' '귀가' '조치' '오빠' '무리'
 '옆' '여자' '대접' '파티' '대부분' '오' '망신살' '사양' '인생' '샷' '잡고' '사진' '박아' '인생' '샷'
 '남여' '남여' '착석' '게임' '밖' '입' '단속' '화장']
시간 37
['자리' '전' '계속' '마당' '자제' '일' '얘기' '고민' '상담' '흑' '기사' '자처' '심보' '전화기' '분위기'
 '진지' '즉시' '귀가' '조치' '오빠' '무리' '옆' '여자' '대접' '개념' '실수' '당부' '부담' '오빠' '무리'
 '옆' '여자' '대접' '오늘' '날' '길거리' '차']
시간 35
나 2
['거울' '오늘' '내' '모습' '널' '말' '날씨' '뻔' '말' '장난' '오늘' '웃음' '오늘' '햇볕' '날' '거리'
 '거울' '얼굴' '정도' '널' '말' '날씨' '장난' '오늘' '웃음' '제정신' '자식' '삼류' '소설' '땅' '처음'
 '대한민국' '땅' '이름' '바' '의용' '수비대']
생각 29
대상 5
시간 3
['경비대' '행사' '절' '니들' '꿈' '물' '무리' '등기' '부' '등본' '떼' '무리' '역사책' '무리' '말'
 '억지' '부리' '니들' '소망' '꿈' '예전' '잘못' '이제' '고개' '때' '땅' '동남쪽' '뱃길' '리' '동남쪽'
 '리' '때' '고종' '혼' '주기' '지리지' '시치미']
대상 37
['떼' '일쑤' '태정' '관' '지령' '문' '공개' '아' '일본' '공개' '토론회' '때' '말' '진실' '등기부'
 '등본' '떼' '무리' '역사책' '무리' '말' '억지' '부리' '니들' '소망' '꿈' '예전' '잘못' '이제' '고개'
 '때' '땅' '동남쪽' '뱃길' '리' '동남쪽' '땅']
대상 34
생각 3
['별' '땅' '별' '안용복' '노비' '이의' '이름' '바다' '위' '섬' '하나' '곁' '이름' '짝사랑' '입' '다'
 '속' '마' '귀신' '눈' '대한민국' '마' '리' '동남쪽' '땅' '별' '땅' '별' '리' '마음' '둘' '그림'
 '말' '누' '뺨' '며칠' '사이']
대상 26
생각 11
['일' '전' '여' '번호' '힙합' '난' '어쿠스틱' '나이' '사랑' '사연' '속' '쓰레기' '비교' '내가' '마음'
 '둘' '그림' '말' '누' '친구' '때' '걱정' '문제' '욕' '바지' '미소' '거울' '민낯' '때' '제일' '장면'
 '엄마' '기절' '노릇' '이상' '표현' '사실']
생각 26
시간 11
['이름' '사주' '타로' '카드' '만남' '집착' '전' '남친' '집' '근처' '내가' '마음' '둘' '그림' '말'
 '누' '밤새' '모습' '아침' '입' '당장' '마음' '둘' '그림' '말' '누' '키' '때' '상상' '꿀' '단잠'
 '자신감' '행동' '부족' '끝' '꿈' '가']
생각 28
시간 8
대상 1
['힘' '하루' '목' '소리' '누' '심기' '손' '사람' '머리' '오늘' '고생' '이번' '주말' '눈' '팔' '기대'
 '오늘' '마' '이' '밤' '눈' '눈' '허리' '팔' '동안' '주말' '일' '정신' '몸' '욕심' '압박' '머리'
 '때' '시원' '무대' '위' '오늘']
생각 13
대상 13
시간 11
['일' '편안' '현실' '꼬리' '전' '이상' '아무것' '생각' '준비' '안' '오늘' '마' '이' '밤' '눈' '눈'
 '허리' '팔' '온도' '오늘' '아침' '몸' '옆' '기대' '옆' '손' '절대' '눈' '걱정' '마' '시간' '오늘'
 '밤' '곁' '곁' '손' '오늘']
시간 18
생각 14
대상 5
['마' '이' '밤' '눈' '눈' '허리' '팔' '노래' '주제' '이야기' '가능' '둘' '이야기' '하루' '절대'
 '말로' '거짓' '미안' '눈' '몸' '몸' '몸매' '몸' '몸' '몸매' '몸' '몸' '몸매' '몸' '몸' '몸매'
 '몸' '몸' '몸매' '앞' '비' '세']
대상 29
시간 8
['엉덩이' '대' '구릿빛' '피부' '허벅지' '택시' '기사' '감상' '변태' '변태' '진심' '연기' '담배' '관계'
 '무엇' '지금' '소개' '가슴' '자매' '쌍둥이' '둘' '부' '비부' '비' '춤' '침대' '추지' '규칙' '휴식'
 '계속' '주지' '미안' '눈' '몸' '몸' '몸매' '몸']
대상 27
생각 5
시간 5
['몸' '몸매' '몸' '몸' '몸매' '몸' '몸' '몸매' '몸' '몸' '몸매' '목' '폴' '라' '태' '몸매' '목'
 '메이' '칵테일' '멍' '해진' '동공' '초점' '동태' '원초적' '본능' '해진' '떡' '매' '눈매' '메두사' '빵'
 '코피' '허리선' '펀치' '라인' '피부']
대상 34
나 3
['말투' '부산' '부모님' '한국' '분' '어' '골반' '수입산' '복장' '불량' '맛' '탐' '자연산' '복숭아'
 '수박' '클럽' '안' '동물' '농장' '발' '정난' '수컷' '사육사' '마굿간' '친구' '누' '건' '신경' '방식'
 '미안' '눈' '몸' '몸' '몸매' '몸' '몸' '몸매']
대상 25
생각 12
['몸' '몸' '몸매' '몸' '몸' '몸매' '몸' '몸' '몸매' '미안' '눈' '몸' '몸' '몸매' '몸' '몸' '몸매'
 '몸' '몸' '몸매' '몸' '몸' '몸매' '몸' '몸' '몸매' '오늘' '밤' '특별' '해' '브라더' '술' '기분'
 '전화' '길' '형' '빅']
대상 35
시간 2
['브라더' '오케이' '클럽' '리듬' '파워' '취한' '티' '몸' '개그' '집' '눈' '입' '모양' '형' '옆'
 '오늘' '호랑' '나비' '꽃' '귀' '클럽' '눈빛' '술' '눈동자' '건배' '막차' '첫차' '때' '고삐' '망아지'
 '밤새' '춤' '호랑' '나비' '호랑' '나비' '간만']
시간 34
생각 3
['지금' '난' '쇼' '미' '댄스' '클럽' '위치' '느낌' '직진' '걸음걸이' '흥국' '형의' '지' '차' '짬'
 '선배' '후배' '위' '미친개' '때' '이제' '갈게' '정상' '위' '인천' '언니' '가' '눈' '말발' '번호'
 '전화' '클럽' '눈빛' '술' '눈동자' '건배' '막차']
시간 27
나 6
대상 4
['첫차' '때' '고삐' '망아지' '밤새' '춤' '호랑' '나비' '호랑' '나비' '쇼' '미' '만수' '르' '아가씨'
 '손' '악수' '저번' '달' '반응' '엄마' '말' '밤' '홍' '대' '나의' '목' '소리' '리듬' '파워' '호랑'
 '나비' '호랑' '나비' '호랑' '나비' '호랑']
시간 37
['나비' '밤' '담' '차례' '앞' '막장' '게릴라' '경배' '목청' '찌' '질' '분위기' '전환' '광기' '남자'
 '품위' '여자' '가식' '이유' '자신감' '몸속' '알' '이상' '정신' '오늘' '무' '불' '심장' '총' '빵'
 '야' '빵' '야' '빵' '빵' '야' '빵']
나 31
시간 6
['야' '빵' '야' '마라' '마' '마라' '마' '오늘' '밤' '끝장' '끝장' '오늘' '밤' '끝장' '빵' '야'
 '빵' '야' '빵' '야' '널' '금' '순간' '하늘' '때' '너와' '찬양' '불침번' '밤새' '축지법' '노래'
 '꼭지점' '신' '신점' '비명' '소리' '마성']
나 24
시간 12
생각 1
['멜로디' '독기' '연결' '고리' '사방' '팔방' '오방' '고삐' '불' '심장' '총' '빵' '야' '빵' '야' '빵'
 '빵' '야' '빵' '야' '빵' '야' '마라' '마' '마라' '마' '오늘' '밤' '끝장' '끝장' '오늘' '밤'
 '끝장' '빵' '야' '빵' '야']
나 35
시간 2
['빵' '남자' '위로' '여자' '라' '남자' '위로' '여자' '라' '문제' '말' '질투' '자격지심' '사람' '답지'
 '바' '바' '바' '맘' '쇼윈도' '눈' '키' '어깨' '비참' '자신' '무엇' '비교' '마' '어제' '카페' '알바'
 '앞' '내가' '이상' '이상' '머릿속' '문제']
생각 36
나 1
['말' '질투' '자격지심' '사람' '답지' '바' '바' '바' '맘' '오빠' '때' '친구' '남자' '친구' '놈'
 '가식' '덩어리' '늑대' '순' '위험' '내' '울타리' '안' '사진' '자신' '아무것' '필요' '내' '나도' '남자'
 '사람' '내가' '이상' '이상' '머릿속' '문제' '말']
생각 31
나 5
시간 1
['질투' '자격지심' '사람' '답지' '바' '바' '바' '맘' '바' '바' '바' '맘' '말' '오해' '걱정'
 '자격지심' '말' '자격' '지심' '때' '생각' '혼자' '겁' '내가' '날' '때' '사실' '고' '겁' '때' '연습'
 '말' '야' '좌절' '시' '시해' '원래']
생각 33
대상 4
['기회' '인생' '위기' '법' '천국' '여행' '캐리어' '마라' '일' '뒷바라지' '부모님' '사진' '동생' '거울'
 '이자' '가족' '별' '잠' '숙면' '야' '병신' '티' '마' '마음' '눈물' '사내' '새끼' '책임감' '아무것'
 '때' '눈' '겁' '말' '때' '목' '겁' '겁']
대상 20
생각 14
나 3
['입버릇' '상대' '계속' '싸움' '이성' '엄마' '눈치' '대중' '관심' '속' '한곳' '라' '무덤' '아버지' '날'
 '정답' '어른' '엔' '난' '방법' '짓' '하기' '걸' '무식' '채찍질' '하기' '상처' '아무것' '때' '눈'
 '겁' '말' '때' '목' '겁' '겁' '겁']
대상 27
생각 10
['감사' '종교' '전' '꼬맹이' '이용' '악덕' '대표' '구원' '지금' '회사' '무대' '참가자' '남자' '삶'
 '하늘' '아빠' '가족' '어깨' '형제' '멤버' '오늘' '위로' '내일' '겁쟁이' '성숙' '해진' '나로' '아무것'
 '때' '눈' '겁' '말' '때' '목' '겁' '겁' '난']
대상 22
시간 11
생각 4
['바닥' '꼴' '도시' '일' '삶' '소' '후' '카피' '걸' '마이크' '덕' '돈' '진실' '돈' '신실' '지금'
 '시간' '해' '결국' '투명' '믿음' '내' '신조' '리듬' '기회' '깨' '밤' '손' '때' '공포' '미친개'
 '보고' '가야' '내가' '모습' '시선' '티']
나 19
생각 18
['손' '듣기' '미' '신원' '미상' '삶' '속' '삶' '속의' '뜬눈' '밤' '날' '멜로디' '귀' '귀' '뜬눈'
 '밤' '날' '멜로디' '귀' '귀' '곁' '필요' '혼자' '선' '해' '신발' '신은' '채로' '확률' '열망' '소리'
 '귀' '경험' '때' '누' '누']
나 30
생각 7
['때' '볼륨' '칸' '악셀' '위' '발' '혼돈' '혼란' '멋' '억대' '세상' '베토벤' '환생' '삶' '속' '삶'
 '속의' '뜬눈' '밤' '날' '멜로디' '귀' '귀' '뜬눈' '밤' '날' '멜로디' '귀' '귀' '순' '짓' '무엇'
 '날' '내' '열망' '세상' '돌']
나 31
대상 5
생각 1

# 2. Word2Vec 코드를 활용하여 본인이 원하는 텍스트 넣어 보기 => 텍스트 + 원하는 키워드 5개의 유사 단어 추출한 후 결과 첨부  

model = word2vec.Word2Vec.load("lyric.model")
model.most_similar("나")
#결과
[('살아나다', 0.9804494380950928),
 ('위치', 0.9731336832046509),
 ('기도', 0.968995213508606),
 ('당연하다', 0.9683068990707397),
 ('땅', 0.9679484367370605),
 ('번', 0.9678696393966675),
 ('이', 0.9660961031913757),
 ('누가', 0.9646477103233337),
 ('난', 0.9641587734222412),
 ('노래', 0.9632538557052612)]

model.most_similar("노력")
[('그걸', 0.9829491376876831),
 ('움직이다', 0.9679090976715088),
 ('목소리', 0.9675102233886719),
 ('코피', 0.9664987921714783),
 ('의미', 0.965485692024231),
 ('고맙다', 0.9631837010383606),
 ('보내다', 0.9630695581436157),
 ('주', 0.962887167930603),
 ('순', 0.9622533917427063),
 ('외치다', 0.9621490240097046)]

model.most_similar("꿈")
[('삶', 0.979951024055481),
 ('바람', 0.9684405326843262),
 ('네', 0.9641295671463013),
 ('대다', 0.9639453887939453),
 ('잃어버리다', 0.9637987017631531),
 ('식지', 0.9636280536651611),
 ('풀리다', 0.9624108076095581),
 ('가지다', 0.9609981179237366),
 ('고', 0.9606809616088867),
 ('매다', 0.9605456590652466)]

model.most_similar("돈")
[('다시', 0.9717226028442383),
 ('넘어지다', 0.9702568650245667),
 ('냉철하다', 0.970013439655304),
 ('여기다', 0.9698784947395325),
 ('전부', 0.9676408767700195),
 ('때론', 0.9673455357551575),
 ('정', 0.96500563621521),
 ('기회', 0.9644238352775574),
 ('외제', 0.9635425806045532),
 ('저러다', 0.9618752002716064)]

model.similarity('꿈','노력')
#결과 0.932422

model.similarity('꿈','돈')
# 0.88770175
